##### 판다스: 표 형식의 데이터나 다양한 형태의 데이터를 다루는 데 초점을 맞춤
##### 넘파이: 단일 산술 배열 데이터를 다루는 데 특화되어 있음

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### 5.1 판다스 자료구조 소개
#### 5.1.1 Series

In [2]:
obj=pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2=pd.Series([4,7,-5,3],index=["d","b","a","c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj2["a"]

-5

In [8]:
obj2["d"]

4

In [9]:
obj2[["c","a","d"]]

c    3
a   -5
d    4
dtype: int64

In [10]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [11]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [12]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [13]:
"b" in obj2

True

In [14]:
"e" in obj2

False

In [15]:
sdata={"Ohio":35000,"Texas":71000,"Oregon":16000,"Utah":5000}
obj3=pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [16]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [17]:
states=["California","Ohio","Oregon","Texas"]
obj4=pd.Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [18]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [21]:
obj4.name="population"
obj4.index.name="state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [22]:
obj.index=["Bob","Steve","Jeff","Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

#### 5.1.2 Dataframe

In [23]:
data={"state":["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
     "year":[2000,2001,2002,2001,2002,2003],
     "pop":[1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [24]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [25]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
pd.DataFrame(data,columns=["year","state","pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [27]:
frame2=pd.DataFrame(data,columns=["year","state","pop","debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [28]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [29]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [30]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [31]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [32]:
frame2.iloc[2] #loc과 iloc은 5.2.3에서 다룸

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [33]:
frame2["debt"]=16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [34]:
frame2["debt"]=np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [35]:
val=pd.Series([-1.2,-1.5,-1.7],index=["two","four","five"])
frame2["debt"]=val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [36]:
frame2["eastern"]=frame2["state"]=="Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [37]:
del frame2["eastern"]
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [38]:
populations={"Ohio":{2000:1.5,2001:1.7,2002:3.6},
            "Nevada":{2001:2.4,2002:2.9}}
frame3=pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [39]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [40]:
pd.DataFrame(populations,index=[2001,2002,2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [41]:
pdata={"Ohio":frame3["Ohio"][:-1],
      "Nevada":frame3["Nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [42]:
frame3.index.name="year"
frame3.columns.name="state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [43]:
frame3.to_numpy() #2차원 형태의 ndarray로 반화

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [44]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

#### 5.1.3 색인 개체

In [45]:
obj=pd.Series(np.arange(3),index=["a","b","c"])
index=obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [46]:
index[1:]

Index(['b', 'c'], dtype='object')

In [47]:
# index[1]="d" -> Type error
labels=pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int32')

In [48]:
obj2=pd.Series([1.5,-2.5,0],index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [49]:
obj2.index is labels

True

In [50]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [51]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [52]:
"Ohio" in frame3.columns

True

In [53]:
2003 in frame3.index

False

In [54]:
pd.Index(["foo","foo","bar","bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

#### 색인 메서드와 속성
**append()** : 추가적인 색인 객체를 덧붙여 새로운 색인을 반환  
difference() : 색인의 차집합을 반환  
intersection() : 색인의 교집합을 반환  
union() : 색인의 합집합  
isin() : 색인이 넘겨받은 색인에 존재하는지  
delete() : i 위치의 색인이 삭제된 새로운 색인을 반환  
**drop()** : 넘겨받은 값이 삭제된 새로운 색인을 반환  
inset() : i 위치에 색인이 추가된 새로운 색인을 반환  
is_monotic() : 색인이 단조성을 가진다면 True를 반환  
**is_unique()** : 중복되는 색인이 없다면 True를 반환  
**unique()** : 색인에서 중복되는 요소를 제거하고 유일한 값만 반환

### 5.2 핵심 기능
#### 5.2.1 재색인

In [55]:
obj=pd.Series([4.5,7.2,-5.3,3.6],index=["d","b","a","c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [56]:
obj2=obj.reindex(["a","b","c","d","e"])
obj2
#다음과 같이 존재하지 않는 색인값은 NaN으로 추가됨.

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [57]:
obj3=pd.Series(["blue","purple","yellow"],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [58]:
obj3.reindex(np.arange(6),method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [59]:
frame=pd.DataFrame(np.arange(9).reshape((3,3)),
                  index=["a","c","d"],
                  columns=["Ohio","Texas","California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [60]:
frame2=frame.reindex(index=["a","b","c","d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [61]:
states=["Texas","Utah","California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [62]:
frame.reindex(states,axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

#### reindex 함수의 옵션
labels : 색인으로 사용할 새로운 순서, Index 인스턴스나 다른 순차적인 파이썬 자료구조를 사용할 수 있음. Index는 복사가 이루어지지 않고 그대로 사용됨  
index : 전달된 시퀀스를 새로운 행 레이블로 지정  
columns : 전달된 시퀀스를 새로운 열 레이블로 지정  
axis : 색인으로 사용할 축을 지정. 기본값은 행이다.  
method : 채움 메서드, ffill은 직전값을 채워 넣고 bfill은 다음 값을 채워 넣는다.  
fill_value :  재색인 과정 중에 새로운 나타나는 비어 있는 데이터를 채우기 위한 값. 빈곳의 결과에 null을 채우려면 fill_value="missing"  
limit : 전/후 보간 시에 사용할 최대 갭 크기  
tolerance : 전/후 보간 시에 사용할 최대 갭 크기  
copy : True인 경우 새로운 색인이 이전 색인과 동일하더라도 기본 데이터를 복사한다. False인 경우 새로운 색인이 이전 색인과 동일할 경우 복사하지 않는다

In [63]:
frame.loc[["a","d","c"],["California","Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

#### 5.2.2 하나의 행이나 열 삭제하기

In [64]:
obj=pd.Series(np.arange(5.),index=["a","b","c","d","e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [65]:
new_obj=obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [66]:
obj.drop(["d","c"]) #아래와 같이 원래 데이터는 멀쩡함

a    0.0
b    1.0
e    4.0
dtype: float64

In [67]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [68]:
data= pd.DataFrame(np.arange(16).reshape((4,4)),
                  index=["Ohio","Colorado","Utah","New York"],
                  columns=["one","two","three","four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
data.drop(index=["Colorado","Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [70]:
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [71]:
data.drop("two",axis=1) #열값 삭제

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [72]:
data.drop(["two","four"],axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

#### 5.2.3 색인하기, 선택하기, 거르기

In [73]:
obj=pd.Series(np.arange(4.),index=["a","b","c","d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [74]:
obj["b"]

1.0

In [75]:
obj[1]

1.0

In [76]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [77]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [78]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [79]:
obj.loc[["b","a","d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [80]:
obj1=pd.Series([1,2,3],index=[2,0,1])
obj2=pd.Series([1,2,3],index=["a","b","c"])
obj1

2    1
0    2
1    3
dtype: int64

In [81]:
obj2

a    1
b    2
c    3
dtype: int64

In [82]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [83]:
obj2[[0,1,2]]
# obj2.loc[[0,1,2]]은 색인에 정수가 포함되어 있지 않기 때문에 실패한다.

a    1
b    2
c    3
dtype: int64

In [84]:
# iloc의 경우 색인이 정수를 포함하고 있는지 여부와 상관없이 일관되게 정수로만 색인을 취한다.
obj1.iloc[[0,1,2]]

2    1
0    2
1    3
dtype: int64

In [85]:
obj2.iloc[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [86]:
# Waring: 레이블을 사용해 슬라이싱 할 수 있으나, 보통의 파이썬 슬라이싱과 다르게 엔드포인트가 포함된다.
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [87]:
obj2.loc["b":"c"]=5
obj2

a    1
b    5
c    5
dtype: int64

In [88]:
data= pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=["Ohio","Colorado","Utah","New York"],
                   columns=["one","two","three","four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [89]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [90]:
data[["three","one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [91]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [92]:
data[data["three"]>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [94]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### loc와 iloc
### *loc* is typically used for label indexing and can access multiple columns, 
### while *iloc* is used for integer indexing
### 즉, 레이블에 대해서는 loc을 쓰고, 정수색인에 대해서는 iloc

In [95]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [96]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [97]:
data.loc[["Colorado","New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [98]:
data.loc["Colorado",["two","three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [99]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [100]:
data.iloc[[2,1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [101]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [102]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [103]:
data.loc[:"Utah","two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [104]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [105]:
data.loc[data.three>=2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### 정수 색인의 함정

In [106]:
ser=pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [107]:
# ser[-1]
# KeyError: -1

In [108]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [109]:
ser2 = pd.Series(np.arange(3.),index=["a","b","c"])
ser2[-1]

2.0

In [110]:
ser.iloc[-1]

2.0

In [111]:
ser[:2]

0    0.0
1    1.0
dtype: float64

#### 연쇄 색인의 함정

In [112]:
data.loc[:,"one"]=1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [113]:
data.iloc[2]=5
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [114]:
data.loc[data["four"]>5]=3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [115]:
#data.loc[data.three==5]["three"]=6
#A value is trying to be set on a copy of a slice from a DataFrame.
#이게 바로 연쇄 색인의 문제
# 이를 피하기 위해서는 loc 연산을 사용해야 함.

In [116]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [117]:
data.loc[data.three==5,"three"]=6
data
#값을 할당할 떄는 연쇄 색인을 피하는 것이 좋다

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

#### 5.2.4 산술 연산과 데이터 정렬

In [120]:
s1=pd.Series([7.3,-2.5,3.4,1.5],index=["a","c","d","e"])
s2=pd.Series([-2.1,3.6,-1.5,3,3.1],index=["a","c","e","f","g"])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [121]:
s2

a   -2.1
c    3.6
e   -1.5
f    3.0
g    3.1
dtype: float64

In [122]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [125]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), 
                   columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [126]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [127]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### 위와 같이 NaN값으로 나타나는 경우는 대상 값 중 하나가 없는 경우이다

In [128]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})
df1

   A
0  1
1  2

In [129]:
df2

   B
0  3
1  4

#### 산술 연산 메서드에 채워 넣을 값 지정하기

In [132]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),columns=list("abcde"))
df2.loc[1, "b"] = np.nan
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [133]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [134]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [135]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [136]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [137]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [138]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### 산술 연산 메소드
add, radd	Methods for addition (+)  
sub, rsub	Methods for subtraction (-)  
div, rdiv	Methods for division (/)  
floordiv, rfloordiv	Methods for floor division (//)  
mul, rmul	Methods for multiplication (*)  
pow, rpow	Methods for exponentiation (**)

#### DataFrame과 Series 간의 연산

In [139]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [140]:
arr[0]

array([0., 1., 2., 3.])

In [141]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [143]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
series = frame.iloc[0]

In [144]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [145]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [146]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [147]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int32

In [148]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [149]:
series3 = frame["d"]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [150]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [151]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

#### 5.2.5 함수 적용과 매핑

In [152]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [153]:
frame

               b         d         e
Utah    1.821379 -1.380230  0.992943
Ohio   -3.144499 -0.647486 -0.758882
Texas  -1.271640  0.810797 -2.409798
Oregon -0.654531  0.068514  0.757761

In [154]:
np.abs(frame)

               b         d         e
Utah    1.821379  1.380230  0.992943
Ohio    3.144499  0.647486  0.758882
Texas   1.271640  0.810797  2.409798
Oregon  0.654531  0.068514  0.757761

In [156]:
def f1(x):
    return x.max() - x.min()
frame.apply(f1)

b    4.965877
d    2.191027
e    3.402741
dtype: float64

In [157]:
frame.apply(f1, axis="columns")

Utah      3.201609
Ohio      2.497013
Texas     3.220595
Oregon    1.412292
dtype: float64

In [159]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])
frame.apply(f2)

            b         d         e
min -3.144499 -1.380230 -2.409798
max  1.821379  0.810797  0.992943

In [160]:
def my_format(x):
    return f"{x:.2f}"
frame.applymap(my_format)

            b      d      e
Utah     1.82  -1.38   0.99
Ohio    -3.14  -0.65  -0.76
Texas   -1.27   0.81  -2.41
Oregon  -0.65   0.07   0.76

In [161]:
frame["e"].map(my_format)

Utah       0.99
Ohio      -0.76
Texas     -2.41
Oregon     0.76
Name: e, dtype: object

#### 5.2.6 정렬과 순위

In [162]:
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [163]:
obj.sort_index() #알파벳순으로 정렬

a    1
b    2
c    3
d    0
dtype: int32

In [164]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index=["three", "one"],
                    columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [165]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [166]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [167]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [169]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values() #값을 기준으로 정렬

2   -3
3    2
0    4
1    7
dtype: int64

In [170]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values() #다음과 같이 NaN이 끝으로 간다

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [171]:
obj.sort_values(na_position="first") #NaN이 가장 먼저 오게 함

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [172]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [173]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [174]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [175]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [176]:
obj.rank(method="first") #평균 순위가 아닌 먼저 출현한 순서대로 6,7을 적용

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [177]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [178]:
frame=pd.DataFrame({"b":[4.3,7,-3,2],
                   "a":[0,1,0,1],
                   "c":[-2,5,8,-2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [179]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

#### 순위의 동률을 처리하는 메서드
"average":	Default: assign the average rank to each entry in the equal group  
"min":	Use the minimum rank for the whole group  
"max":	Use the maximum rank for the whole group  
"first":	Assign ranks in the order the values appear in the data  
"dense":	Like method="min", but ranks always increase by 1 between groups   rather: than the number of equal elements in a group

#### 5.2.7 중복 색인

In [180]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [181]:
obj.index.is_unique

False

In [182]:
obj["a"]

a    0
a    1
dtype: int32

In [183]:
obj["c"]

4

In [184]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                   index=["a", "a", "b", "b", "c"])
df

          0         1         2
a -0.122603  0.462318  1.544416
a  0.847277 -1.349341  1.099523
b  0.917094  0.093299  0.697280
b  1.583992 -0.623291 -1.451488
c  1.835803 -1.065115 -0.339318

In [185]:
df.loc["b"]

          0         1         2
b  0.917094  0.093299  0.697280
b  1.583992 -0.623291 -1.451488

In [186]:
df.loc["c"]

0    1.835803
1   -1.065115
2   -0.339318
Name: c, dtype: float64

### 5.3 기술 통계 계산과 요약

In [188]:
df=pd.DataFrame([[1.4,np.nan],[7.1-4.5],
                [np.nan,np.nan],[0.75,-1.3]],index=["a","b","c","d"],
               columns=["one","two"])
df

    one  two
a  1.40  NaN
b  2.60  NaN
c   NaN  NaN
d  0.75 -1.3

In [189]:
df.sum()

one    4.75
two   -1.30
dtype: float64

In [190]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [191]:
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [192]:
df.sum(axis="columns", skipna=False)

a     NaN
b     NaN
c     NaN
d   -0.55
dtype: float64

In [193]:
df.mean(axis="columns")

a    1.400
b    2.600
c      NaN
d   -0.275
dtype: float64

#### 축소 메소드이 옵션
axis::	Axis to reduce over; "index" for DataFrame’s rows and "columns" for columns  
skipna:  	Exclude missing values; True by default  
level:	Reduce grouped by level if the axis is hierarchically   indexed (MultiIndex)

In [194]:
df.idxmax()

one    b
two    d
dtype: object

In [195]:
df.cumsum()

    one  two
a  1.40  NaN
b  4.00  NaN
c   NaN  NaN
d  4.75 -1.3

In [196]:
df.describe()

            one  two
count  3.000000  1.0
mean   1.583333 -1.3
std    0.938527  NaN
min    0.750000 -1.3
25%    1.075000 -1.3
50%    1.400000 -1.3
75%    2.000000 -1.3
max    2.600000 -1.3

In [197]:
obj = pd.Series(["a", "a", "b", "c"] * 4)

In [198]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

#### 요약통계관련 메서드
**count**:	Number of non-NA values    
**describe**:	Compute set of summary statistics  
**min, max**:	Compute minimum and maximum values  
**argmin, argmax**:	Compute index locations (integers) at which minimum or maximum value is obtained, respectively; not available on DataFrame objects  
**idxmin, idxmax**:	Compute index labels at which minimum or maximum value is obtained, respectively quantile Compute sample 

**quantile** ranging from 0 to 1 (default: 0.5)  
**sum**  Sum of values  
**mean**	Mean of values  
**median**	Arithmetic median (50% quantile) of values  
**mad**	Mean absolute deviation from mean value  
**prod**	Product of all values  
**var**	Sample variance of values  
**std**	Sample standard deviation of values  
**skew**	Sample skewness (third moment) of values  
**kurt**	Sample kurtosis (fourth moment) of values  
**cumsum**	Cumulative sum of values  
**cummin, cummax**	Cumulative minimum or maximum of values, respectively  
**cumprod**	Cumulative product of values  
**diff**	Compute first arithmetic difference (useful for time series)  
**pct_change**	Compute percent changes

#### 5.3.1 상관관계와 공분산

In [203]:
price = pd.read_pickle("yahoo_price.pkl")
volume = pd.read_pickle("yahoo_volume.pkl")

In [204]:
returns = price.pct_change()

In [205]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [206]:
returns["MSFT"].corr(returns["IBM"])

0.4997636114415116

In [207]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703548e-05

In [208]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [209]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [210]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [211]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

#### 5.3.2 유일값, 값 세기, 멤버십

In [214]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [215]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [216]:
pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [217]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [219]:
mask = obj.isin(["b", "c"])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [220]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [223]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])
unique_vals = pd.Series(["c", "b", "a"])
indices = pd.Index(unique_vals).get_indexer(to_match)
indices

array([0, 2, 1, 1, 0, 2], dtype=int64)

#### 유일값, 값 세기, 멤버십 메서드
**isin**	Compute a Boolean array indicating whether each Series or DataFrame value is contained in the passed sequence of values  
**get_indexer**	Compute integer indices for each value in an array into another array of distinct values; helpful for data alignment and join-type operations  
**unique**	Compute an array of unique values in a Series, returned in the order observed  
**value_counts**	Return a Series containing unique values as its index and frequencies as its values, ordered count in descending order

In [225]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3], 
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [226]:
data["Qu1"].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [228]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [229]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [230]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64